package me.cal1br.webserverprogramming.api.user.model;

import lombok.Data;

@Data
/*    1.1. Регистрация на потребител: Всеки потребител трябва да предостави следната
информация:
        ▪ потребителско име - малки и големи латински букви и "_". Дължина между 5
и 15 символа. Задължително поле
        ▪ парола - задължително поле. Дължина между 6 и 20 символа. Трябва да
съдържа:
            - поне 1 малка латинска буква
            - поне 1 голяма латинска буква
            - поне един специален символ[@, -, _, ~, |]
        ▪ E-mail адрес: валиден e-mail адрес. Задължително поле
        ▪ Телефон: Полето не е задължително. Може да съдържа само цифри, интервал
и тире('-')*/
public class UserRegistrationModel {
    private String username;
    private String password;
    private String email;
    private String phone;
}
